In [1]:
import pandas as pd
import numpy as np

In [39]:
df=pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['Column1','Column2','Column3','Column4'])

In [3]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      int32
 1   Column2  5 non-null      int32
 2   Column3  5 non-null      int32
 3   Column4  5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [6]:
df.describe()

         Column1    Column2    Column3    Column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [8]:
type(df['Column1'])

pandas.core.series.Series

In [10]:
type(df[['Column1','Column2']])

pandas.core.frame.DataFrame

In [13]:
df.loc[['Row1','Row2']]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7

In [20]:
df.iloc[2:4,0:2]

      Column1  Column2
Row3        8        9
Row4       12       13

In [25]:
df.iloc[[1,4],[0,3]]

      Column1  Column4
Row2        4        7
Row5       16       19

In [29]:
#convert dataframe into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [31]:
#basic operation:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [32]:
# df=pd.DataFrame(data=[[1,np.nan,2],[1,3,4]],
#                 index=
#                 ['Row1','Row2'],
#                 columns=
#                 ['Column1','Column2','Column3'])

In [33]:
df

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4

In [35]:
df.isnull().sum()

Column1    0
Column2    1
Column3    0
dtype: int64

In [40]:
#to count
df['Column3'].value_counts()

2     1
6     1
10    1
14    1
18    1
Name: Column3, dtype: int64

In [41]:
df['Column2'].unique()

array([ 1,  5,  9, 13, 17])

In [42]:
df[df['Column2']>2]

      Column1  Column2  Column3  Column4
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [47]:
import numpy as np
import pandas as pd
ser=pd.Series()
print(ser)

data=np.array(['p','y','t','h','o','n'])
ser=pd.Series(data)
print(ser)

Series([], dtype: float64)
0    p
1    y
2    t
3    h
4    o
5    n
dtype: object

C:\Users\Prabhjyot Singh\AppData\Local\Temp\ipykernel_19624\2738825304.py:3: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser=pd.Series()

In [48]:
data={
    'apples':[3,2,0,1],
    'oranges':[0,3,7,2]
      }

purchases=pd.DataFrame(data)
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [49]:
purchases=pd.DataFrame(data,index=['June','Robert','Lily','David'])
purchases

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [50]:
purchases.loc['June']

apples     3
oranges    0
Name: June, dtype: int64

In [57]:
import pandas as pd
list=['Aman', 'Aryan', 'Arpita', 'Yushra', 
            'Khalid', 'Neekita', 'Vipin']

df=pd.DataFrame(list,columns=['Names'])
print(df)

     Names
0     Aman
1    Aryan
2   Arpita
3   Yushra
4   Khalid
5  Neekita
6    Vipin

In [58]:
#data of list:
data={'Name':['Prabh','Sam','Aakash','Kaushal','Khalid'],
      'Age':[20,19,19,18,21]
      }
df=pd.DataFrame(data)
print(df)

      Name  Age
0    Prabh   20
1      Sam   19
2   Aakash   19
3  Kaushal   18
4   Khalid   21

In [59]:
print(df['Name'])

0      Prabh
1        Sam
2     Aakash
3    Kaushal
4     Khalid
Name: Name, dtype: object

CSV file:

In [64]:
data=pd.read_csv("C:/Users/Prabhjyot Singh/Dropbox/PC/Desktop/nba.csv")
data_top=data.head()
data_top

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0